[Entrench X2AbilityTemplate]
LocFriendlyName="Entrench"
LocLongDescription="Hunker Down lasts until you move. Only works in cover."
LocHelpText="Hunker Down lasts until you move. Only works in cover."
LocFlyOverText="Entrench"
LocPromotionPopupText="<Bullet/> Entrench confers +30 defense and +50 dodge, just like regular Hunker Down.<br/>"

[TakeUnder X2AbilityTemplate]
LocFriendlyName="Take Under"
LocLongDescription="An attack with your melee weapon that always hits and doesn't end the turn. Can only be used against wounded targets on 3 or less health."
LocHelpText="Finish off an enemy."
LocFlyOverText="Take Under"
LocPromotionPopupText="<Bullet/> Mechanically, this works just like the standard slash.\n<Bullet/>Attacking with a dash move will still only cost one action, but you need to have two actions currently available to dash.\n<Bullet/>This attack will never miss or graze, but its damage can still be mitigated by armor and other damage reduction effects.<br/>"

[Beatdown X2AbilityTemplate]
LocFriendlyName="Beatdown"
LocLongDescription="Strike an enemy with the butt of your weapon, dealing only little damage, but stunning the target. Can only be used on unarmored, non-robotic targets. Has a 3 turn cooldown."
LocHelpText="Deals 1 damage, stuns target. Can't target armored or mechanical enemies."
LocFlyOverText="Beatdown"
LocPromotionPopupText="<Bullet/> Do 1 damage to an enemy utilizing the butt of your gun. Stuns the target. Can only be used on unarmored, non-robotic targets. Has a 3 turn cooldown.<br/>"

[ABB_Infiltrator X2AbilityTemplate]
LocFriendlyName="Heist Artist"
LocFlyOverText="Heist Artist"
LocLongDescription="Your skills are required for a job. As a master of espionage and intel acquisition, you gain +150 Hacking."
LocHelpText="You gain +150 Hacking."
LocPromotionPopupText="<Bullet/> Your hacking score is big enough to ensure getting a bonus on most hack missions.<br/><Bullet/>Note that you still can't use Gremlins and are unable to hack towers, bots, etc.<br/><Bullet/>The bonus DOES apply to Skullmining."

[DriveOut X2AbilityTemplate]
LocFriendlyName="Drive Out"
LocLongDescription="Strike an enemy with the butt of your weapon, dealing only little damage, but knocking the target back, possibly out of cover. Cannot be used against mechanical targets. Has a 3 turn cooldown."
LocHelpText="Deals 2 damage and knocks back target. Can't target mechanical enemies."
LocFlyOverText="Drive Out"

[ABB_Parkour X2AbilityTemplate]
LocFriendlyName="Parkour"
LocHelpText="This soldier is able to climb walls."
LocLongDescription="This soldier is able to climb walls. Note that windows cannot be climbed."

[Anatomy X2AbilityTemplate]
LocFriendlyName="Anatomy"
LocFlyOverText="Anatomy"
LocLongDescription="You know exactly where to strike to cause the most damage. You gain +15% Critical Chance and 2 Armor Pierce on all attacks."
LocHelpText="You gain bonuses to Critical Chance and Armor Pierce."
LocPromotionPopupText="<Bullet/> This is an unconditional passive bonus.\n<Bullet/> The Armor Pierce bonus will not show on attack previews, but it will function when the attack lands."

[Interrogator X2AbilityTemplate]
LocFriendlyName="Interrogator"
LocFlyOverText="Interrogator"
LocLongDescription="At one point, this job involved dialogue. Gain +2 Skullmining charges when carrying the Skulljack."
LocHelpText="Gain +2 Skullmining charges when carrying the Skulljack."
LocPromotionPopupText="<Bullet/> The Skullmining project in the Proving Ground must be completed for this ability to have any effect."

[SlashAndDashRS X2AbilityTemplate]
LocFriendlyName="Run And Slice"
LocLongDescription="Move to and slice a target. Uses one action and doesn't end the turn but can only be used once per turn. Has a 4 turn cooldown that can be reset by using other knife perks."
LocHelpText="Move to and slice a target. Uses one action and doesn't end the turn but can only be used once per turn. Has a 4 turn cooldown that can be reset by using other knife perks."
LocFlyOverText="Run And Slice"
LocPromotionPopupText="<Bullet/>Move to and slice a target. Uses one action but can only be used once per turn.\n<Bullet/>The abilities that are able to reset the cooldown are Disarming Strike, Lacerate, Shadowmelt and Hamstring."

[DisarmingStrike X2AbilityTemplate]
LocFriendlyName="Disarming Strike"
LocLongDescription="A knife strike that also disables the enemy's primary weapon, forcing the enemy to spend an action to ready it again. Resets Run and Slice. Has a 2 turn cooldown."
LocHelpText="Attack and disarm an enemy."
LocFlyOverText="Disarm"
LocPromotionPopupText="<Bullet/> Like all knife attacks, this uses one action and does not end your turn.\n<Bullet/> The enemy's primary weapon will need to be reloaded before it can be used again.<br/>"

[Lacerate X2AbilityTemplate]
LocFriendlyName="Lacerate"
LocLongDescription="A knife strike that cuts open something important, causing the target to bleed out. Resets Run and Slice. Has a 3 turn cooldown."
LocHelpText="Strike and cause bleeding."
LocFlyOverText="Lacerate"
LocPromotionPopupText="<Bullet/> Like all knife attacks, this uses one action and does not end your turn.\n<Bullet/> The bleeding effect deals 2 damage per turn and lasts for 10 turns.<br/>"

[Shadowmelt X2AbilityTemplate]
LocFriendlyName="Shadowmelt"
LocLongDescription="Strike an enemy with the knife. If you kill the target, enter concealment. Resets Run and Slice. Has a 3 turn cooldown."
LocHelpText="Strike a target. On kill, enter concealment."
LocFlyOverText="Shadowmelt"
LocPromotionPopupText="<Bullet/> Like all knife attacks, this uses one action and does not end your turn.\n<Bullet/> Has a 3 turn cooldown.<br/>"

[Hamstring X2AbilityTemplate]
LocFriendlyName="Hamstring"
LocLongDescription="A crippling knife slash. Applies a permanent -7 movement, -30 aim and -50 dodge debuff. Resets Run and Slice. Has a 3 turn cooldown."
LocHelpText="Slash an enemy, reducing the enemy's movement, aim and dodge."
LocFlyOverText="Hamstring"
LocPromotionPopupText="<Bullet/> Like all knife attacks, this uses one action and does not end your turn.\n<Bullet/> Has a 3 turn cooldown.<br/><Bullet/>Can be applied multiple times to the same enemy; the debuffs stack.<br/>"

[NimbleHands X2AbilityTemplate]
LocFriendlyName="Nimble Hands"
LocLongDescription="As a free action, reload your weapon. Can be used every 3 turns."
LocHelpText="Reload your weapon as a free action."
LocFlyOverText="Nimble Hands"

[ABB_TrialByFire X2AbilityTemplate]
LocFriendlyName="Trial By Fire"
LocLongDescription="Permanently gain +1 Aim and +1 Will at the start of each mission."
LocHelpText="Gain 1 Aim and 1 Will at the start of each mission."
LocPromotionPopupText="<Bullet/>Triggers at the start of each mission.<br/>"
LocFlyOverText="Trial By Fire: +1 aim/will"

[Taunt X2AbilityTemplate]
LocFriendlyName="Taunt"
LocLongDescription="Try to draw enemy fire towards you. Decrease Defense by 30, and increase Dodge by 70. Is used like Hunker Down, ending the turn."
LocHelpText="Try to draw enemy fire towards you. Decrease Defense by 30, and increase Dodge by 70."
LocFlyOverText="Taunt"
LocPromotionPopupText="<Bullet/> Especially useful on soldiers with high armor to mitigate the incoming damage.\n<Bullet/> Is used like Hunker Down, but doesn't require cover. It also doesn't interact with Aim or Deep Cover."

[HiddenReserves X2AbilityTemplate]
LocFriendlyName="Hidden Reserves"
LocLongDescription="Once per mission, as a free action, set all your cooldowns on abilities back to zero."
LocHelpText="Reset all your ability cooldowns."
LocFlyOverText="Hidden Reserves"

[TearDown X2AbilityTemplate]
LocFriendlyName="Tear Down"
LocLongDescription="As a free action, detonate an environmental explosive with a well placed shot."
LocHelpText="Detonate an environmental explosive."
LocPromotionPopupText="<Bullet/> Has a cooldown of 2 turns. Note that unlike the Reaper's Remote Start, Tear Down doesn't boost the explosion's damage or range, but it also does not require any ammo."

[ABB_Bombard X2AbilityTemplate]
LocFriendlyName="Iron Rations"
LocLongDescription="Gain one bonus use on all your grenades and equipped rockets. Also, get one extra Frag Grenade in addition to your equipped grenades."
LocHelpText="Your grenades and rockets gain one extra use each. Also, gain a bonus Frag Grenade."
LocFlyOverText="Iron Rations"
LocPromotionPopupText="<Bullet/> Battle Scanners are also considered grenades for the purposes of this ability. Note that heavy weapons, even if they're rocket or grenade based, are not affected by this ability."

[ABB_Cannonade X2AbilityTemplate]
LocFriendlyName="Cannonade"
LocLongDescription="Gain one bonus use on all your grenades and equipped rockets. Additionally gain the Bombardier ability, letting you launch grenades 2 extra tiles."
LocHelpText="Your grenades and rockets gain one extra use each. Additionally gain the Bombardier ability."
LocFlyOverText="Cannonade"
LocPromotionPopupText="<Bullet/> Battle Scanners are also considered grenades for the purposes of this ability. Note that heavy weapons, even if they're rocket or grenade based, are not affected by this ability."

[Battlespace X2AbilityTemplate]
LocFriendlyName="Battlespace"
LocLongDescription="Increases your vision radius by 3 tiles. Once per mission, you can increase this bonus to 12 tiles for a turn."
LocHelpText="Increases your vision radius by 3 tiles. Once per mission, you can increase this bonus to 12 tiles for a turn."
LocFlyOverText="Battlespace"

[BattlespacePassive X2AbilityTemplate]
LocFriendlyName="Battlespace"
LocLongDescription="You gain +3 sight radius from Battlespace."
LocHelpText="You gain +3 sight radius from Battlespace."
LocPromotionPopupText="<Bullet/> The extra +9 sight radius wears off after one turn.\n<Bullet/> The +3 sight radius is permanent.<br/>"

[MineLayer X2AbilityTemplate]
LocFriendlyName="Minelayer"
LocHelpText="Provides one free proximity mine."
LocLongDescription="Provides one free proximity mine."

[RiotControl X2AbilityTemplate]
LocFriendlyName="Riot Control"
LocLongDescription="You have one free smoke grenade and one free flashbang use on every mission."
LocHelpText="You have one free smoke grenade and one free flashbang use on every mission."
LocFlyOverText="Riot Control"
LocPromotionPopupText="<Bullet/> These Flashbang and Smoke grenades will be equipped even if you're carrying other grenades.<br/>"

[TrainedSniper X2AbilityTemplate]
LocFriendlyName="Trained Sniper"
LocHelpText="Grants the Squadsight ability, but only when a sniper rifle is equipped as this soldier's primary weapon."
LocLongDescription="Grants the Squadsight ability, but only when a sniper rifle is equipped as this soldier's primary weapon."
LocPromotionPopupText="<Bullet/> Any weapon from the sniper rifle category counts for this ability, such as the Auto-Sniper Rifle or the Strike Rifle, in addition to the standard Sniper Rifle.<br/>"

[PerfectPlan X2AbilityTemplate]
LocFriendlyName="Perfect Plan"
LocHelpText="Hacking an objective or an ADVENT Security Tower is now a free action. Additionally gain the Failsafe ability, negating the penalties of failed hacks."
LocLongDescription="Hacking an objective or an ADVENT Security Tower is now a free action. Additionally gain the Failsafe ability, negating the penalties of failed hacks."
LocPromotionPopupText="<Bullet/> Even without a GREMLIN, Failsafe can still guard against failure effects from Skullmining attempts or hacking ADVENT Security Towers with a Hacker's Laptop."

[PerfectPlanEffect X2AbilityTemplate]
LocFriendlyName="Perfect Plan"
LocHelpText="Hacking an objective or an ADVENT Security Tower is now a free action."
LocLongDescription="Hacking an objective or an ADVENT Security Tower is now a free action."

[Jingoistic X2AbilityTemplate]
LocFriendlyName = "Jingoistic"
LocHelpText = "It's time for war. This soldier is granted a grenade slot as well as a heavy weapon slot, regardless of armor worn."
LocLongDescription = "It's time for war. This soldier is granted a grenade slot as well as a heavy weapon slot, regardless of armor worn."
LocPromotionPopupText = "<Bullet/> Note that the bonus slots from this ability do not stack with most other abilities or equipment that offer one or both of the same slots, e.g. EXO or WAR Suits."

[ABB_TakeDown X2AbilityTemplate]
LocFriendlyName="Take Down"
LocFlyOverText="Take Down"
LocHelpText="A melee finisher that never misses and does not end your turn even when used with a dash move, but can only target damaged enemies on 3 or less HP. Can be used once per turn."
LocLongDescription="A melee finisher that never misses and does not end your turn even when used with a dash move, but can only target damaged enemies on 3 or less HP. Can be used once per turn."
LocPromotionPopupText="<Bullet/> This attack always deals 5 damage. If the enemy has enough armor or other damage resistance, Take Down may not always result in a kill.\n<Bullet/> Take Down can be used once per turn, and can be used with a dash only if used as the first action.\n<Bullet/> Unlike Take Under, Take Down does not rely on a melee weapon. Human soldiers will use the stock of their gun, and certain aliens will throw a punch or slash with their claws."